qmckl_distance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Computation of distances</title>
<!-- 2020-10-28 Wed 23:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Computation of distances</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Squared distance</a>
<ul>
<li><a href="#sec-1-1">1.1. <code>qmckl_distance_sq</code></a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Arguments</a></li>
<li><a href="#sec-1-1-2">1.1.2. Requirements</a></li>
<li><a href="#sec-1-1-3">1.1.3. Performance</a></li>
<li><a href="#sec-1-1-4">1.1.4. Header</a></li>
<li><a href="#sec-1-1-5">1.1.5. Source</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Function for the computation of distances between particles.
</p>

<p>
3 files are produced:
</p>
<ul class="org-ul">
<li>a header file : <code>qmckl_distance.h</code>
</li>
<li>a source file : <code>qmckl_distance.f90</code>
</li>
<li>a C test file : <code>test_qmckl_distance.c</code>
</li>
<li>a Fortran test file : <code>test_qmckl_distance_f.f90</code>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Squared distance</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <code>qmckl_distance_sq</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Computes the matrix of the squared distances between all pairs of
points in two sets, one point within each set:
\[
   C_{ij} = \sum_{k=1}^3 (A_{k,i}-B_{k,j})^2
   \]
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Arguments</h4>
<div class="outline-text-4" id="text-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>context</code></td>
<td class="left">input</td>
<td class="left">Global state</td>
</tr>

<tr>
<td class="left"><code>transa</code></td>
<td class="left">input</td>
<td class="left">Array <code>A</code> is <code>N</code>: Normal, <code>T</code>: Transposed</td>
</tr>

<tr>
<td class="left"><code>transb</code></td>
<td class="left">input</td>
<td class="left">Array <code>B</code> is <code>N</code>: Normal, <code>T</code>: Transposed</td>
</tr>

<tr>
<td class="left"><code>m</code></td>
<td class="left">input</td>
<td class="left">Number of points in the first set</td>
</tr>

<tr>
<td class="left"><code>n</code></td>
<td class="left">input</td>
<td class="left">Number of points in the second set</td>
</tr>

<tr>
<td class="left"><code>A(lda,3)</code></td>
<td class="left">input</td>
<td class="left">Array containing the \(m \times 3\) matrix \(A\)</td>
</tr>

<tr>
<td class="left"><code>lda</code></td>
<td class="left">input</td>
<td class="left">Leading dimension of array <code>A</code></td>
</tr>

<tr>
<td class="left"><code>B(ldb,3)</code></td>
<td class="left">input</td>
<td class="left">Array containing the \(n \times 3\) matrix \(B\)</td>
</tr>

<tr>
<td class="left"><code>ldb</code></td>
<td class="left">input</td>
<td class="left">Leading dimension of array <code>B</code></td>
</tr>

<tr>
<td class="left"><code>C(ldc,n)</code></td>
<td class="left">output</td>
<td class="left">Array containing the \(m \times n\) matrix \(C\)</td>
</tr>

<tr>
<td class="left"><code>ldc</code></td>
<td class="left">input</td>
<td class="left">Leading dimension of array <code>C</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Requirements</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><code>context</code> is not 0
</li>
<li><code>m</code> &gt; 0
</li>
<li><code>n</code> &gt; 0
</li>
<li><code>lda</code> &gt;= 3 if <code>transa</code> is <code>N</code>
</li>
<li><code>lda</code> &gt;= m if <code>transa</code> is <code>T</code>
</li>
<li><code>ldb</code> &gt;= 3 if <code>transb</code> is <code>N</code>
</li>
<li><code>ldb</code> &gt;= n if <code>transb</code> is <code>T</code>
</li>
<li><code>ldc</code> &gt;= m if <code>transa</code> is =
</li>
<li><code>A</code> is allocated with at least \(3 \times m \times 8\) bytes
</li>
<li><code>B</code> is allocated with at least \(3 \times n \times 8\) bytes
</li>
<li><code>C</code> is allocated with at least \(m \times n \times 8\) bytes
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Performance</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
This function might be more efficient when <code>A</code> and <code>B</code> are
transposed.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Header</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">

<pre class="src src-C">qmckl_exit_code qmckl_distance_sq(qmckl_context context,
				  char transa, char transb,
				  int64_t m, int64_t n,
				  double *A, int64_t lda,
				  double *B, int64_t ldb,
				  double *C, int64_t ldc);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Source</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">

<pre class="src src-f90">integer function qmckl_distance_sq_f(context, transa, transb, m, n, A, LDA, B, LDB, C, LDC) result(info)
  implicit none
  integer*8  , intent(in)  :: context
  character  , intent(in)  :: transa, transb
  integer*8  , intent(in)  :: m, n
  integer*8  , intent(in)  :: lda
  real*8     , intent(in)  :: A(lda,*)
  integer*8  , intent(in)  :: ldb
  real*8     , intent(in)  :: B(ldb,*)
  integer*8  , intent(in)  :: ldc
  real*8     , intent(out) :: C(ldc,*)

  integer*8 :: i,j
  real*8    :: x, y, z
  integer   :: transab

  info = 0

  if (context == 0_8) then
     info = -1
     return
  endif

  if (m &lt;= 0_8) then
     info = -2
     return
  endif

  if (n &lt;= 0_8) then
     info = -3
     return
  endif

  if (transa == 'N' .or. transa == 'n') then
     transab = 0
  else if (transa == 'T' .or. transa == 't') then
     transab = 1
  else
     transab = -100
  endif

  if (transb == 'N' .or. transb == 'n') then
     continue
  else if (transa == 'T' .or. transa == 't') then
     transab = transab + 2
  else
     transab = -100
  endif

  if (transab &lt; 0) then
     info = -4
     return 
  endif

  if (iand(transab,1) == 0 .and. LDA &lt; 3) then
     info = -5
     return
  endif

  if (iand(transab,1) == 1 .and. LDA &lt; m) then
     info = -6
     return
  endif

  if (iand(transab,2) == 0 .and. LDA &lt; 3) then
     info = -6
     return
  endif

  if (iand(transab,2) == 2 .and. LDA &lt; m) then
     info = -7
     return
  endif


  select case (transab)

  case(0)

     do j=1,n
	do i=1,m
	   x = A(1,i) - B(1,j)
	   y = A(2,i) - B(2,j)
	   z = A(3,i) - B(3,j)
	   C(i,j) = x*x + y*y + z*z
	end do
     end do

  case(1)

     do j=1,n
	do i=1,m
	   x = A(i,1) - B(1,j)
	   y = A(i,2) - B(2,j)
	   z = A(i,3) - B(3,j)
	   C(i,j) = x*x + y*y + z*z
	end do
     end do

  case(2)

     do j=1,n
	do i=1,m
	   x = A(1,i) - B(j,1)
	   y = A(2,i) - B(j,2)
	   z = A(3,i) - B(j,3)
	   C(i,j) = x*x + y*y + z*z
	end do
     end do

  case(3)

     do j=1,n
	do i=1,m
	   x = A(i,1) - B(j,1)
	   y = A(i,2) - B(j,2)
	   z = A(i,3) - B(j,3)
	   C(i,j) = x*x + y*y + z*z
	end do
     end do

  end select

end function qmckl_distance_sq_f
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-10-28 Wed 23:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
